// Даны два числа. Показать большее и меньшее число
Console.Clear();
int a = 3;
int b = 2;
if (a>b)
{
  Console.WriteLine(" max a, min b");  
}
else
{
    Console.WriteLine(" max b, min a"); 
}